# Ultralytics YOLO11 + ReForm-Net ABFN 结构
nc: 6
scales:
  n: [0.50, 0.25, 1024]

# 1. Backbone（下采样全部用 SCDown）
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SCDown, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, SCDown, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, SCDown, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, SCDown, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]      # 9
  - [-1, 2, C2PSA, [1024]]        # 10
  - [-1, 1, MDLA, [1024]]
# 2. ABFN Neck（完全匹配论文双向融合结构）
head:
  # --- Top-Down 路径 ---             
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12: 上采样
  - [[-1, 6], 1, Concat, [1]]                 # 13: 和 P4 融合
  - [-1, 2, C3k2, [512, False]]               # 14: 特征处理

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15: 上采样
  - [[-1, 4], 1, Concat, [1]]                 # 16: 和 P3 融合
  - [-1, 2, C3k2, [256, False]]               # 17: P3/8 输出

  # --- Bottom-Up 路径（用 SCDown 下采样）---
  - [-1, 1, SCDown, [256, 3, 2]]              # 18: P3 下采样
  - [[-1, 14], 1, Concat, [1]]                 # 19: 和 P4 融合
  - [-1, 2, C3k2, [512, False]]               # 20: P4/16 输出

  - [-1, 1, SCDown, [512, 3, 2]]              # 21: P4 下采样
  - [[-1, 11], 1, Concat, [1]]                # 22: 和增强后的 P5 融合
  - [-1, 2, C3k2, [1024, True]]               # 23: P5/32 输出

  # --- 检测头 ---
  - [[17, 20, 23], 1, Detect, [nc]]